杂项运算符
下表列出了 C++ 支持的其他一些重要的运算符。

运算符	描述
sizeof	                sizeof 运算符返回变量的大小。例如，sizeof(a) 将返回 4，其中 a 是整数。
Condition ? X : Y	条件运算符。如果 Condition 为真 ? 则值为 X : 否则值为 Y。
,	                逗号运算符会顺序执行一系列运算。整个逗号表达式的值是以逗号分隔的列表中的最后一个表达式的值。
.（点）和 ->（箭头）	 成员运算符用于引用类、结构和共用体的成员。
Cast	                强制转换运算符把一种数据类型转换为另一种数据类型。例如，int(2.2000) 将返回 2。
&	                指针运算符 & 返回变量的地址。例如 &a; 将给出变量的实际地址。
*	                指针运算符 * 指向一个变量。例如，*var; 将指向变量 var。


C++ 中的运算符优先级
下表将按运算符优先级从高到低列出各个运算符，具有较高优先级的运算符出现在表格的上面，具有较低优先级的运算符出现在表格的下面。在表达式中，较高优先级的运算符会优先被计算。

类别 	        运算符 	                              结合性 
后缀 	        () [] -> . ++ - -  	                从左到右 
一元 	        + - ! ~ ++ - - (type)* & sizeof 	从右到左 
乘除 	        * / % 	                                从左到右 
加减 	        + - 	                                从左到右 
移位 	        << >> 	                                从左到右 
关系 	        < <= > >= 	                        从左到右 
相等 	        == != 	                                从左到右 
位与 AND  	& 	                                从左到右 
位异或 XOR 	^ 	                               从左到右 
位或 OR 	        | 	                                从左到右 
逻辑与 AND 	&& 	                                从左到右 
逻辑或 OR  	|| 	                                从左到右 
条件 	        ?: 	                                从右到左 
赋值 	        = += -= *= /= %=>>= <<= &= ^= |= 	从右到左 
逗号 	        , 	                                从左到右 
